/*!
 * =====================================================
 * SUI Mobile - http://m.sui.taobao.org/
 *
 * =====================================================
 */
// jshint ignore: start
+function($){

$.smConfig.rawCitiesData = [
    {
        "name": "北京市",
        "id": "1001",
        "sub": [
            {
                "name": "全市",
                "id": "1001",
                "sub": [
                    {
                        "name": "平谷区",
                        "id": "1395"
                    }
                ],
                "type": 0
            },
            {
                "name": "县",
                "id": "1001",
                "sub": {
                    "1": {
                        "name": "延庆县",
                        "id": "1397"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "天津市",
        "id": "1002",
        "sub": [
            {
                "name": "全市",
                "id": "1002",
                "sub": [
                    {
                        "name": "宝坻区",
                        "id": "1412"
                    }
                ],
                "type": 0
            },
            {
                "name": "县",
                "id": "1002",
                "sub": {
                    "1": {
                        "name": "蓟　县",
                        "id": "1415"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "河北省",
        "id": "1003",
        "sub": [
            {
                "name": "石家庄市",
                "id": "1003",
                "sub": [
                    {
                        "name": "鹿泉市",
                        "id": "1439"
                    }
                ],
                "type": 0
            },
            {
                "name": "唐山市",
                "id": "1003",
                "sub": {
                    "1": {
                        "name": "迁安市",
                        "id": "1454"
                    }
                },
                "type": 0
            },
            {
                "name": "秦皇岛市",
                "id": "1003",
                "sub": {
                    "2": {
                        "name": "卢龙县",
                        "id": "1462"
                    }
                },
                "type": 0
            },
            {
                "name": "邯郸市",
                "id": "1003",
                "sub": {
                    "3": {
                        "name": "武安市",
                        "id": "1482"
                    }
                },
                "type": 0
            },
            {
                "name": "邢台市",
                "id": "1003",
                "sub": {
                    "4": {
                        "name": "沙河市",
                        "id": "1502"
                    }
                },
                "type": 0
            },
            {
                "name": "保定市",
                "id": "1003",
                "sub": {
                    "5": {
                        "name": "高碑店市",
                        "id": "1528"
                    }
                },
                "type": 0
            },
            {
                "name": "张家口市",
                "id": "1003",
                "sub": {
                    "6": {
                        "name": "崇礼县",
                        "id": "1546"
                    }
                },
                "type": 0
            },
            {
                "name": "承德市",
                "id": "1003",
                "sub": {
                    "7": {
                        "name": "围场满族蒙古族自治县",
                        "id": "1558"
                    }
                },
                "type": 0
            },
            {
                "name": "沧州市",
                "id": "1003",
                "sub": {
                    "8": {
                        "name": "河间市",
                        "id": "1575"
                    }
                },
                "type": 0
            },
            {
                "name": "廊坊市",
                "id": "1003",
                "sub": {
                    "9": {
                        "name": "三河市",
                        "id": "1586"
                    }
                },
                "type": 0
            },
            {
                "name": "衡水市",
                "id": "1003",
                "sub": {
                    "10": {
                        "name": "深州市",
                        "id": "1598"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "山西省",
        "id": "1004",
        "sub": [
            {
                "name": "太原市",
                "id": "1004",
                "sub": [
                    {
                        "name": "古交市",
                        "id": "1609"
                    }
                ],
                "type": 0
            },
            {
                "name": "大同市",
                "id": "1004",
                "sub": {
                    "1": {
                        "name": "大同县",
                        "id": "1621"
                    }
                },
                "type": 0
            },
            {
                "name": "阳泉市",
                "id": "1004",
                "sub": {
                    "2": {
                        "name": "盂　县",
                        "id": "1627"
                    }
                },
                "type": 0
            },
            {
                "name": "长治市",
                "id": "1004",
                "sub": {
                    "3": {
                        "name": "潞城市",
                        "id": "1641"
                    }
                },
                "type": 0
            },
            {
                "name": "晋城市",
                "id": "1004",
                "sub": {
                    "4": {
                        "name": "高平市",
                        "id": "1648"
                    }
                },
                "type": 0
            },
            {
                "name": "朔州市",
                "id": "1004",
                "sub": {
                    "5": {
                        "name": "怀仁县",
                        "id": "1655"
                    }
                },
                "type": 0
            },
            {
                "name": "晋中市",
                "id": "1004",
                "sub": {
                    "6": {
                        "name": "介休市",
                        "id": "1667"
                    }
                },
                "type": 0
            },
            {
                "name": "运城市",
                "id": "1004",
                "sub": {
                    "7": {
                        "name": "河津市",
                        "id": "1681"
                    }
                },
                "type": 0
            },
            {
                "name": "忻州市",
                "id": "1004",
                "sub": {
                    "8": {
                        "name": "原平市",
                        "id": "1696"
                    }
                },
                "type": 0
            },
            {
                "name": "临汾市",
                "id": "1004",
                "sub": {
                    "9": {
                        "name": "霍州市",
                        "id": "1714"
                    }
                },
                "type": 0
            },
            {
                "name": "吕梁市",
                "id": "1004",
                "sub": {
                    "10": {
                        "name": "汾阳市",
                        "id": "1728"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "内蒙古自治区",
        "id": "1005",
        "sub": [
            {
                "name": "呼和浩特市",
                "id": "1005",
                "sub": [
                    {
                        "name": "武川县",
                        "id": "1738"
                    }
                ],
                "type": 0
            },
            {
                "name": "包头市",
                "id": "1005",
                "sub": {
                    "1": {
                        "name": "达尔罕茂明安联合旗",
                        "id": "1748"
                    }
                },
                "type": 0
            },
            {
                "name": "乌海市",
                "id": "1005",
                "sub": {
                    "2": {
                        "name": "乌达区",
                        "id": "1752"
                    }
                },
                "type": 0
            },
            {
                "name": "赤峰市",
                "id": "1005",
                "sub": {
                    "3": {
                        "name": "敖汉旗",
                        "id": "1765"
                    }
                },
                "type": 0
            },
            {
                "name": "通辽市",
                "id": "1005",
                "sub": {
                    "4": {
                        "name": "霍林郭勒市",
                        "id": "1774"
                    }
                },
                "type": 0
            },
            {
                "name": "鄂尔多斯市",
                "id": "1005",
                "sub": {
                    "5": {
                        "name": "伊金霍洛旗",
                        "id": "1782"
                    }
                },
                "type": 0
            },
            {
                "name": "呼伦贝尔市",
                "id": "1005",
                "sub": {
                    "6": {
                        "name": "根河市",
                        "id": "1796"
                    }
                },
                "type": 0
            },
            {
                "name": "巴彦淖尔市",
                "id": "1005",
                "sub": {
                    "7": {
                        "name": "杭锦后旗",
                        "id": "1804"
                    }
                },
                "type": 0
            },
            {
                "name": "乌兰察布市",
                "id": "1005",
                "sub": {
                    "8": {
                        "name": "丰镇市",
                        "id": "1816"
                    }
                },
                "type": 0
            },
            {
                "name": "兴安盟",
                "id": "1005",
                "sub": {
                    "9": {
                        "name": "突泉县",
                        "id": "1822"
                    }
                },
                "type": 0
            },
            {
                "name": "锡林郭勒盟",
                "id": "1005",
                "sub": {
                    "10": {
                        "name": "多伦县",
                        "id": "1834"
                    }
                },
                "type": 0
            },
            {
                "name": "阿拉善盟",
                "id": "1005",
                "sub": {
                    "11": {
                        "name": "额济纳旗",
                        "id": "1837"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "辽宁省",
        "id": "1006",
        "sub": [
            {
                "name": "沈阳市",
                "id": "1006",
                "sub": [
                    {
                        "name": "新民市",
                        "id": "1851"
                    }
                ],
                "type": 0
            },
            {
                "name": "大连市",
                "id": "1006",
                "sub": {
                    "1": {
                        "name": "庄河市",
                        "id": "1862"
                    }
                },
                "type": 0
            },
            {
                "name": "鞍山市",
                "id": "1006",
                "sub": {
                    "2": {
                        "name": "海城市",
                        "id": "1870"
                    }
                },
                "type": 0
            },
            {
                "name": "抚顺市",
                "id": "1006",
                "sub": {
                    "3": {
                        "name": "清原满族自治县",
                        "id": "1878"
                    }
                },
                "type": 0
            },
            {
                "name": "本溪市",
                "id": "1006",
                "sub": {
                    "4": {
                        "name": "桓仁满族自治县",
                        "id": "1885"
                    }
                },
                "type": 0
            },
            {
                "name": "丹东市",
                "id": "1006",
                "sub": {
                    "5": {
                        "name": "凤城市",
                        "id": "1892"
                    }
                },
                "type": 0
            },
            {
                "name": "锦州市",
                "id": "1006",
                "sub": {
                    "6": {
                        "name": "北宁市",
                        "id": "1900"
                    }
                },
                "type": 0
            },
            {
                "name": "营口市",
                "id": "1006",
                "sub": {
                    "7": {
                        "name": "大石桥市",
                        "id": "1907"
                    }
                },
                "type": 0
            },
            {
                "name": "阜新市",
                "id": "1006",
                "sub": {
                    "8": {
                        "name": "彰武县",
                        "id": "1915"
                    }
                },
                "type": 0
            },
            {
                "name": "辽阳市",
                "id": "1006",
                "sub": {
                    "9": {
                        "name": "灯塔市",
                        "id": "1923"
                    }
                },
                "type": 0
            },
            {
                "name": "盘锦市",
                "id": "1006",
                "sub": {
                    "10": {
                        "name": "盘山县",
                        "id": "1928"
                    }
                },
                "type": 0
            },
            {
                "name": "铁岭市",
                "id": "1006",
                "sub": {
                    "11": {
                        "name": "开原市",
                        "id": "1936"
                    }
                },
                "type": 0
            },
            {
                "name": "朝阳市",
                "id": "1006",
                "sub": {
                    "12": {
                        "name": "凌源市",
                        "id": "1944"
                    }
                },
                "type": 0
            },
            {
                "name": "葫芦岛市",
                "id": "1006",
                "sub": {
                    "13": {
                        "name": "兴城市",
                        "id": "1951"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "吉林省",
        "id": "1007",
        "sub": [
            {
                "name": "长春市",
                "id": "1007",
                "sub": [
                    {
                        "name": "德惠市",
                        "id": "1962"
                    }
                ],
                "type": 0
            },
            {
                "name": "吉林市",
                "id": "1007",
                "sub": {
                    "1": {
                        "name": "磐石市",
                        "id": "1972"
                    }
                },
                "type": 0
            },
            {
                "name": "四平市",
                "id": "1007",
                "sub": {
                    "2": {
                        "name": "双辽市",
                        "id": "1979"
                    }
                },
                "type": 0
            },
            {
                "name": "辽源市",
                "id": "1007",
                "sub": {
                    "3": {
                        "name": "东辽县",
                        "id": "1984"
                    }
                },
                "type": 0
            },
            {
                "name": "通化市",
                "id": "1007",
                "sub": {
                    "4": {
                        "name": "集安市",
                        "id": "1992"
                    }
                },
                "type": 0
            },
            {
                "name": "白山市",
                "id": "1007",
                "sub": {
                    "5": {
                        "name": "临江市",
                        "id": "1999"
                    }
                },
                "type": 0
            },
            {
                "name": "松原市",
                "id": "1007",
                "sub": {
                    "6": {
                        "name": "扶余县",
                        "id": "2005"
                    }
                },
                "type": 0
            },
            {
                "name": "白城市",
                "id": "1007",
                "sub": {
                    "7": {
                        "name": "大安市",
                        "id": "2011"
                    }
                },
                "type": 0
            },
            {
                "name": "延边朝鲜族自治州",
                "id": "1007",
                "sub": {
                    "8": {
                        "name": "安图县",
                        "id": "2019"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "黑龙江省",
        "id": "1008",
        "sub": [
            {
                "name": "哈尔滨市",
                "id": "1008",
                "sub": [
                    {
                        "name": "五常市",
                        "id": "2039"
                    }
                ],
                "type": 0
            },
            {
                "name": "齐齐哈尔市",
                "id": "1008",
                "sub": {
                    "1": {
                        "name": "讷河市",
                        "id": "2056"
                    }
                },
                "type": 0
            },
            {
                "name": "鸡西市",
                "id": "1008",
                "sub": {
                    "2": {
                        "name": "密山市",
                        "id": "2066"
                    }
                },
                "type": 0
            },
            {
                "name": "鹤岗市",
                "id": "1008",
                "sub": {
                    "3": {
                        "name": "绥滨县",
                        "id": "2075"
                    }
                },
                "type": 0
            },
            {
                "name": "双鸭山市",
                "id": "1008",
                "sub": {
                    "4": {
                        "name": "饶河县",
                        "id": "2084"
                    }
                },
                "type": 0
            },
            {
                "name": "大庆市",
                "id": "1008",
                "sub": {
                    "5": {
                        "name": "杜尔伯特蒙古族自治县",
                        "id": "2094"
                    }
                },
                "type": 0
            },
            {
                "name": "伊春市",
                "id": "1008",
                "sub": {
                    "6": {
                        "name": "铁力市",
                        "id": "2112"
                    }
                },
                "type": 0
            },
            {
                "name": "佳木斯市",
                "id": "1008",
                "sub": {
                    "7": {
                        "name": "富锦市",
                        "id": "2124"
                    }
                },
                "type": 0
            },
            {
                "name": "七台河市",
                "id": "1008",
                "sub": {
                    "8": {
                        "name": "勃利县",
                        "id": "2129"
                    }
                },
                "type": 0
            },
            {
                "name": "牡丹江市",
                "id": "1008",
                "sub": {
                    "9": {
                        "name": "穆棱市",
                        "id": "2140"
                    }
                },
                "type": 0
            },
            {
                "name": "黑河市",
                "id": "1008",
                "sub": {
                    "10": {
                        "name": "五大连池市",
                        "id": "2147"
                    }
                },
                "type": 0
            },
            {
                "name": "绥化市",
                "id": "1008",
                "sub": {
                    "11": {
                        "name": "海伦市",
                        "id": "2158"
                    }
                },
                "type": 0
            },
            {
                "name": "大兴安岭地区",
                "id": "1008",
                "sub": {
                    "12": {
                        "name": "漠河县",
                        "id": "2161"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "上海市",
        "id": "1009",
        "sub": [
            {
                "name": "全市",
                "id": "1009",
                "sub": [
                    {
                        "name": "奉贤区",
                        "id": "2179"
                    }
                ],
                "type": 0
            },
            {
                "name": "县",
                "id": "1009",
                "sub": {
                    "1": {
                        "name": "崇明县",
                        "id": "2180"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "江苏省",
        "id": "1010",
        "sub": [
            {
                "name": "南京市",
                "id": "1010",
                "sub": [
                    {
                        "name": "高淳县",
                        "id": "2194"
                    }
                ],
                "type": 0
            },
            {
                "name": "无锡市",
                "id": "1010",
                "sub": {
                    "1": {
                        "name": "宜兴市",
                        "id": "2203"
                    }
                },
                "type": 0
            },
            {
                "name": "徐州市",
                "id": "1010",
                "sub": {
                    "2": {
                        "name": "邳州市",
                        "id": "2215"
                    }
                },
                "type": 0
            },
            {
                "name": "常州市",
                "id": "1010",
                "sub": {
                    "3": {
                        "name": "金坛市",
                        "id": "2223"
                    }
                },
                "type": 0
            },
            {
                "name": "苏州市",
                "id": "1010",
                "sub": {
                    "4": {
                        "name": "太仓市",
                        "id": "2235"
                    }
                },
                "type": 0
            },
            {
                "name": "南通市",
                "id": "1010",
                "sub": {
                    "5": {
                        "name": "海门市",
                        "id": "2244"
                    }
                },
                "type": 0
            },
            {
                "name": "连云港市",
                "id": "1010",
                "sub": {
                    "6": {
                        "name": "灌南县",
                        "id": "2252"
                    }
                },
                "type": 0
            },
            {
                "name": "淮安市",
                "id": "1010",
                "sub": {
                    "7": {
                        "name": "金湖县",
                        "id": "2261"
                    }
                },
                "type": 0
            },
            {
                "name": "盐城市",
                "id": "1010",
                "sub": {
                    "8": {
                        "name": "大丰市",
                        "id": "2271"
                    }
                },
                "type": 0
            },
            {
                "name": "扬州市",
                "id": "1010",
                "sub": {
                    "9": {
                        "name": "江都市",
                        "id": "2279"
                    }
                },
                "type": 0
            },
            {
                "name": "镇江市",
                "id": "1010",
                "sub": {
                    "10": {
                        "name": "句容市",
                        "id": "2286"
                    }
                },
                "type": 0
            },
            {
                "name": "泰州市",
                "id": "1010",
                "sub": {
                    "11": {
                        "name": "姜堰市",
                        "id": "2293"
                    }
                },
                "type": 0
            },
            {
                "name": "宿迁市",
                "id": "1010",
                "sub": {
                    "12": {
                        "name": "泗洪县",
                        "id": "2299"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "浙江省",
        "id": "1011",
        "sub": [
            {
                "name": "杭州市",
                "id": "1011",
                "sub": [
                    {
                        "name": "临安市",
                        "id": "2313"
                    }
                ],
                "type": 0
            },
            {
                "name": "宁波市",
                "id": "1011",
                "sub": {
                    "1": {
                        "name": "奉化市",
                        "id": "2325"
                    }
                },
                "type": 0
            },
            {
                "name": "温州市",
                "id": "1011",
                "sub": {
                    "2": {
                        "name": "乐清市",
                        "id": "2337"
                    }
                },
                "type": 0
            },
            {
                "name": "嘉兴市",
                "id": "1011",
                "sub": {
                    "3": {
                        "name": "桐乡市",
                        "id": "2345"
                    }
                },
                "type": 0
            },
            {
                "name": "湖州市",
                "id": "1011",
                "sub": {
                    "4": {
                        "name": "安吉县",
                        "id": "2351"
                    }
                },
                "type": 0
            },
            {
                "name": "绍兴市",
                "id": "1011",
                "sub": {
                    "5": {
                        "name": "嵊州市",
                        "id": "2358"
                    }
                },
                "type": 0
            },
            {
                "name": "金华市",
                "id": "1011",
                "sub": {
                    "6": {
                        "name": "永康市",
                        "id": "2368"
                    }
                },
                "type": 0
            },
            {
                "name": "衢州市",
                "id": "1011",
                "sub": {
                    "7": {
                        "name": "江山市",
                        "id": "2375"
                    }
                },
                "type": 0
            },
            {
                "name": "舟山市",
                "id": "1011",
                "sub": {
                    "8": {
                        "name": "嵊泗县",
                        "id": "2380"
                    }
                },
                "type": 0
            },
            {
                "name": "台州市",
                "id": "1011",
                "sub": {
                    "9": {
                        "name": "临海市",
                        "id": "2390"
                    }
                },
                "type": 0
            },
            {
                "name": "丽水市",
                "id": "1011",
                "sub": {
                    "10": {
                        "name": "龙泉市",
                        "id": "2400"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "安徽省",
        "id": "1012",
        "sub": [
            {
                "name": "合肥市",
                "id": "1012",
                "sub": [
                    {
                        "name": "肥西县",
                        "id": "2408"
                    }
                ],
                "type": 0
            },
            {
                "name": "芜湖市",
                "id": "1012",
                "sub": {
                    "1": {
                        "name": "南陵县",
                        "id": "2416"
                    }
                },
                "type": 0
            },
            {
                "name": "蚌埠市",
                "id": "1012",
                "sub": {
                    "2": {
                        "name": "固镇县",
                        "id": "2424"
                    }
                },
                "type": 0
            },
            {
                "name": "淮南市",
                "id": "1012",
                "sub": {
                    "3": {
                        "name": "凤台县",
                        "id": "2431"
                    }
                },
                "type": 0
            },
            {
                "name": "马鞍山市",
                "id": "1012",
                "sub": {
                    "4": {
                        "name": "当涂县",
                        "id": "2436"
                    }
                },
                "type": 0
            },
            {
                "name": "淮北市",
                "id": "1012",
                "sub": {
                    "5": {
                        "name": "濉溪县",
                        "id": "2441"
                    }
                },
                "type": 0
            },
            {
                "name": "铜陵市",
                "id": "1012",
                "sub": {
                    "6": {
                        "name": "铜陵县",
                        "id": "2446"
                    }
                },
                "type": 0
            },
            {
                "name": "安庆市",
                "id": "1012",
                "sub": {
                    "7": {
                        "name": "桐城市",
                        "id": "2458"
                    }
                },
                "type": 0
            },
            {
                "name": "黄山市",
                "id": "1012",
                "sub": {
                    "8": {
                        "name": "祁门县",
                        "id": "2466"
                    }
                },
                "type": 0
            },
            {
                "name": "滁州市",
                "id": "1012",
                "sub": {
                    "9": {
                        "name": "明光市",
                        "id": "2475"
                    }
                },
                "type": 0
            },
            {
                "name": "阜阳市",
                "id": "1012",
                "sub": {
                    "10": {
                        "name": "界首市",
                        "id": "2484"
                    }
                },
                "type": 0
            },
            {
                "name": "宿州市",
                "id": "1012",
                "sub": {
                    "11": {
                        "name": "泗　县",
                        "id": "2490"
                    }
                },
                "type": 0
            },
            {
                "name": "巢湖市",
                "id": "1012",
                "sub": {
                    "12": {
                        "name": "和　县",
                        "id": "2496"
                    }
                },
                "type": 0
            },
            {
                "name": "六安市",
                "id": "1012",
                "sub": {
                    "13": {
                        "name": "霍山县",
                        "id": "2504"
                    }
                },
                "type": 0
            },
            {
                "name": "亳州市",
                "id": "1012",
                "sub": {
                    "14": {
                        "name": "利辛县",
                        "id": "2509"
                    }
                },
                "type": 0
            },
            {
                "name": "池州市",
                "id": "1012",
                "sub": {
                    "15": {
                        "name": "青阳县",
                        "id": "2514"
                    }
                },
                "type": 0
            },
            {
                "name": "宣城市",
                "id": "1012",
                "sub": {
                    "16": {
                        "name": "宁国市",
                        "id": "2522"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "福建省",
        "id": "1013",
        "sub": [
            {
                "name": "福州市",
                "id": "1013",
                "sub": [
                    {
                        "name": "长乐市",
                        "id": "2536"
                    }
                ],
                "type": 0
            },
            {
                "name": "厦门市",
                "id": "1013",
                "sub": {
                    "1": {
                        "name": "翔安区",
                        "id": "2543"
                    }
                },
                "type": 0
            },
            {
                "name": "莆田市",
                "id": "1013",
                "sub": {
                    "2": {
                        "name": "仙游县",
                        "id": "2549"
                    }
                },
                "type": 0
            },
            {
                "name": "三明市",
                "id": "1013",
                "sub": {
                    "3": {
                        "name": "永安市",
                        "id": "2562"
                    }
                },
                "type": 0
            },
            {
                "name": "泉州市",
                "id": "1013",
                "sub": {
                    "4": {
                        "name": "南安市",
                        "id": "2575"
                    }
                },
                "type": 0
            },
            {
                "name": "漳州市",
                "id": "1013",
                "sub": {
                    "5": {
                        "name": "龙海市",
                        "id": "2587"
                    }
                },
                "type": 0
            },
            {
                "name": "南平市",
                "id": "1013",
                "sub": {
                    "6": {
                        "name": "建阳市",
                        "id": "2598"
                    }
                },
                "type": 0
            },
            {
                "name": "龙岩市",
                "id": "1013",
                "sub": {
                    "7": {
                        "name": "漳平市",
                        "id": "2606"
                    }
                },
                "type": 0
            },
            {
                "name": "宁德市",
                "id": "1013",
                "sub": {
                    "8": {
                        "name": "福鼎市",
                        "id": "2616"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "江西省",
        "id": "1014",
        "sub": [
            {
                "name": "南昌市",
                "id": "1014",
                "sub": [
                    {
                        "name": "进贤县",
                        "id": "2626"
                    }
                ],
                "type": 0
            },
            {
                "name": "景德镇市",
                "id": "1014",
                "sub": {
                    "1": {
                        "name": "乐平市",
                        "id": "2631"
                    }
                },
                "type": 0
            },
            {
                "name": "萍乡市",
                "id": "1014",
                "sub": {
                    "2": {
                        "name": "芦溪县",
                        "id": "2637"
                    }
                },
                "type": 0
            },
            {
                "name": "九江市",
                "id": "1014",
                "sub": {
                    "3": {
                        "name": "瑞昌市",
                        "id": "2650"
                    }
                },
                "type": 0
            },
            {
                "name": "新余市",
                "id": "1014",
                "sub": {
                    "4": {
                        "name": "分宜县",
                        "id": "2653"
                    }
                },
                "type": 0
            },
            {
                "name": "鹰潭市",
                "id": "1014",
                "sub": {
                    "5": {
                        "name": "贵溪市",
                        "id": "2657"
                    }
                },
                "type": 0
            },
            {
                "name": "赣州市",
                "id": "1014",
                "sub": {
                    "6": {
                        "name": "南康市",
                        "id": "2676"
                    }
                },
                "type": 0
            },
            {
                "name": "吉安市",
                "id": "1014",
                "sub": {
                    "7": {
                        "name": "井冈山市",
                        "id": "2690"
                    }
                },
                "type": 0
            },
            {
                "name": "宜春市",
                "id": "1014",
                "sub": {
                    "8": {
                        "name": "高安市",
                        "id": "2701"
                    }
                },
                "type": 0
            },
            {
                "name": "抚州市",
                "id": "1014",
                "sub": {
                    "9": {
                        "name": "广昌县",
                        "id": "2713"
                    }
                },
                "type": 0
            },
            {
                "name": "上饶市",
                "id": "1014",
                "sub": {
                    "10": {
                        "name": "德兴市",
                        "id": "2726"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "山东省",
        "id": "1015",
        "sub": [
            {
                "name": "济南市",
                "id": "1015",
                "sub": [
                    {
                        "name": "章丘市",
                        "id": "2737"
                    }
                ],
                "type": 0
            },
            {
                "name": "青岛市",
                "id": "1015",
                "sub": {
                    "1": {
                        "name": "莱西市",
                        "id": "2750"
                    }
                },
                "type": 0
            },
            {
                "name": "淄博市",
                "id": "1015",
                "sub": {
                    "2": {
                        "name": "沂源县",
                        "id": "2759"
                    }
                },
                "type": 0
            },
            {
                "name": "枣庄市",
                "id": "1015",
                "sub": {
                    "3": {
                        "name": "滕州市",
                        "id": "2766"
                    }
                },
                "type": 0
            },
            {
                "name": "东营市",
                "id": "1015",
                "sub": {
                    "4": {
                        "name": "广饶县",
                        "id": "2772"
                    }
                },
                "type": 0
            },
            {
                "name": "烟台市",
                "id": "1015",
                "sub": {
                    "5": {
                        "name": "海阳市",
                        "id": "2785"
                    }
                },
                "type": 0
            },
            {
                "name": "潍坊市",
                "id": "1015",
                "sub": {
                    "6": {
                        "name": "昌邑市",
                        "id": "2798"
                    }
                },
                "type": 0
            },
            {
                "name": "济宁市",
                "id": "1015",
                "sub": {
                    "7": {
                        "name": "邹城市",
                        "id": "2811"
                    }
                },
                "type": 0
            },
            {
                "name": "泰安市",
                "id": "1015",
                "sub": {
                    "8": {
                        "name": "肥城市",
                        "id": "2818"
                    }
                },
                "type": 0
            },
            {
                "name": "威海市",
                "id": "1015",
                "sub": {
                    "9": {
                        "name": "乳山市",
                        "id": "2823"
                    }
                },
                "type": 0
            },
            {
                "name": "日照市",
                "id": "1015",
                "sub": {
                    "10": {
                        "name": "莒　县",
                        "id": "2828"
                    }
                },
                "type": 0
            },
            {
                "name": "莱芜市",
                "id": "1015",
                "sub": {
                    "11": {
                        "name": "钢城区",
                        "id": "2831"
                    }
                },
                "type": 0
            },
            {
                "name": "临沂市",
                "id": "1015",
                "sub": {
                    "12": {
                        "name": "临沭县",
                        "id": "2844"
                    }
                },
                "type": 0
            },
            {
                "name": "德州市",
                "id": "1015",
                "sub": {
                    "13": {
                        "name": "禹城市",
                        "id": "2856"
                    }
                },
                "type": 0
            },
            {
                "name": "聊城市",
                "id": "1015",
                "sub": {
                    "14": {
                        "name": "临清市",
                        "id": "2865"
                    }
                },
                "type": 0
            },
            {
                "name": "滨州市",
                "id": "1015",
                "sub": {
                    "15": {
                        "name": "邹平县",
                        "id": "2873"
                    }
                },
                "type": 0
            },
            {
                "name": "荷泽市",
                "id": "1015",
                "sub": {
                    "16": {
                        "name": "东明县",
                        "id": "2883"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "河南省",
        "id": "1016",
        "sub": [
            {
                "name": "郑州市",
                "id": "1016",
                "sub": [
                    {
                        "name": "登封市",
                        "id": "2896"
                    }
                ],
                "type": 0
            },
            {
                "name": "开封市",
                "id": "1016",
                "sub": {
                    "1": {
                        "name": "兰考县",
                        "id": "2907"
                    }
                },
                "type": 0
            },
            {
                "name": "洛阳市",
                "id": "1016",
                "sub": {
                    "2": {
                        "name": "偃师市",
                        "id": "2923"
                    }
                },
                "type": 0
            },
            {
                "name": "平顶山市",
                "id": "1016",
                "sub": {
                    "3": {
                        "name": "汝州市",
                        "id": "2934"
                    }
                },
                "type": 0
            },
            {
                "name": "安阳市",
                "id": "1016",
                "sub": {
                    "4": {
                        "name": "林州市",
                        "id": "2944"
                    }
                },
                "type": 0
            },
            {
                "name": "鹤壁市",
                "id": "1016",
                "sub": {
                    "5": {
                        "name": "淇　县",
                        "id": "2950"
                    }
                },
                "type": 0
            },
            {
                "name": "新乡市",
                "id": "1016",
                "sub": {
                    "6": {
                        "name": "辉县市",
                        "id": "2963"
                    }
                },
                "type": 0
            },
            {
                "name": "焦作市",
                "id": "1016",
                "sub": {
                    "7": {
                        "name": "孟州市",
                        "id": "2975"
                    }
                },
                "type": 0
            },
            {
                "name": "濮阳市",
                "id": "1016",
                "sub": {
                    "8": {
                        "name": "濮阳县",
                        "id": "2982"
                    }
                },
                "type": 0
            },
            {
                "name": "许昌市",
                "id": "1016",
                "sub": {
                    "9": {
                        "name": "长葛市",
                        "id": "2989"
                    }
                },
                "type": 0
            },
            {
                "name": "漯河市",
                "id": "1016",
                "sub": {
                    "10": {
                        "name": "临颍县",
                        "id": "2995"
                    }
                },
                "type": 0
            },
            {
                "name": "三门峡市",
                "id": "1016",
                "sub": {
                    "11": {
                        "name": "灵宝市",
                        "id": "3002"
                    }
                },
                "type": 0
            },
            {
                "name": "南阳市",
                "id": "1016",
                "sub": {
                    "12": {
                        "name": "邓州市",
                        "id": "3016"
                    }
                },
                "type": 0
            },
            {
                "name": "商丘市",
                "id": "1016",
                "sub": {
                    "13": {
                        "name": "永城市",
                        "id": "3026"
                    }
                },
                "type": 0
            },
            {
                "name": "信阳市",
                "id": "1016",
                "sub": {
                    "14": {
                        "name": "息　县",
                        "id": "3037"
                    }
                },
                "type": 0
            },
            {
                "name": "周口市",
                "id": "1016",
                "sub": {
                    "15": {
                        "name": "项城市",
                        "id": "3048"
                    }
                },
                "type": 0
            },
            {
                "name": "驻马店市",
                "id": "1016",
                "sub": {
                    "16": {
                        "name": "新蔡县",
                        "id": "3059"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "湖北省",
        "id": "1017",
        "sub": [
            {
                "name": "武汉市",
                "id": "1017",
                "sub": [
                    {
                        "name": "新洲区",
                        "id": "3073"
                    }
                ],
                "type": 0
            },
            {
                "name": "黄石市",
                "id": "1017",
                "sub": {
                    "1": {
                        "name": "大冶市",
                        "id": "3080"
                    }
                },
                "type": 0
            },
            {
                "name": "十堰市",
                "id": "1017",
                "sub": {
                    "2": {
                        "name": "丹江口市",
                        "id": "3089"
                    }
                },
                "type": 0
            },
            {
                "name": "宜昌市",
                "id": "1017",
                "sub": {
                    "3": {
                        "name": "枝江市",
                        "id": "3103"
                    }
                },
                "type": 0
            },
            {
                "name": "襄樊市",
                "id": "1017",
                "sub": {
                    "4": {
                        "name": "宜城市",
                        "id": "3113"
                    }
                },
                "type": 0
            },
            {
                "name": "鄂州市",
                "id": "1017",
                "sub": {
                    "5": {
                        "name": "鄂城区",
                        "id": "3117"
                    }
                },
                "type": 0
            },
            {
                "name": "荆门市",
                "id": "1017",
                "sub": {
                    "6": {
                        "name": "钟祥市",
                        "id": "3123"
                    }
                },
                "type": 0
            },
            {
                "name": "孝感市",
                "id": "1017",
                "sub": {
                    "7": {
                        "name": "汉川市",
                        "id": "3131"
                    }
                },
                "type": 0
            },
            {
                "name": "荆州市",
                "id": "1017",
                "sub": {
                    "8": {
                        "name": "松滋市",
                        "id": "3140"
                    }
                },
                "type": 0
            },
            {
                "name": "黄冈市",
                "id": "1017",
                "sub": {
                    "9": {
                        "name": "武穴市",
                        "id": "3151"
                    }
                },
                "type": 0
            },
            {
                "name": "咸宁市",
                "id": "1017",
                "sub": {
                    "10": {
                        "name": "赤壁市",
                        "id": "3158"
                    }
                },
                "type": 0
            },
            {
                "name": "随州市",
                "id": "1017",
                "sub": {
                    "11": {
                        "name": "广水市",
                        "id": "3161"
                    }
                },
                "type": 0
            },
            {
                "name": "恩施土家族苗族自治州",
                "id": "1017",
                "sub": {
                    "12": {
                        "name": "鹤峰县",
                        "id": "3169"
                    }
                },
                "type": 0
            },
            {
                "name": "省直辖行政单位",
                "id": "1017",
                "sub": {
                    "13": {
                        "name": "神农架林区",
                        "id": "3173"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "湖南省",
        "id": "1018",
        "sub": [
            {
                "name": "长沙市",
                "id": "1018",
                "sub": [
                    {
                        "name": "浏阳市",
                        "id": "3183"
                    }
                ],
                "type": 0
            },
            {
                "name": "株洲市",
                "id": "1018",
                "sub": {
                    "1": {
                        "name": "醴陵市",
                        "id": "3193"
                    }
                },
                "type": 0
            },
            {
                "name": "湘潭市",
                "id": "1018",
                "sub": {
                    "2": {
                        "name": "韶山市",
                        "id": "3199"
                    }
                },
                "type": 0
            },
            {
                "name": "衡阳市",
                "id": "1018",
                "sub": {
                    "3": {
                        "name": "常宁市",
                        "id": "3212"
                    }
                },
                "type": 0
            },
            {
                "name": "邵阳市",
                "id": "1018",
                "sub": {
                    "4": {
                        "name": "武冈市",
                        "id": "3225"
                    }
                },
                "type": 0
            },
            {
                "name": "岳阳市",
                "id": "1018",
                "sub": {
                    "5": {
                        "name": "临湘市",
                        "id": "3235"
                    }
                },
                "type": 0
            },
            {
                "name": "常德市",
                "id": "1018",
                "sub": {
                    "6": {
                        "name": "津市市",
                        "id": "3245"
                    }
                },
                "type": 0
            },
            {
                "name": "张家界市",
                "id": "1018",
                "sub": {
                    "7": {
                        "name": "桑植县",
                        "id": "3250"
                    }
                },
                "type": 0
            },
            {
                "name": "益阳市",
                "id": "1018",
                "sub": {
                    "8": {
                        "name": "沅江市",
                        "id": "3257"
                    }
                },
                "type": 0
            },
            {
                "name": "郴州市",
                "id": "1018",
                "sub": {
                    "9": {
                        "name": "资兴市",
                        "id": "3269"
                    }
                },
                "type": 0
            },
            {
                "name": "永州市",
                "id": "1018",
                "sub": {
                    "10": {
                        "name": "江华瑶族自治县",
                        "id": "3281"
                    }
                },
                "type": 0
            },
            {
                "name": "怀化市",
                "id": "1018",
                "sub": {
                    "11": {
                        "name": "洪江市",
                        "id": "3294"
                    }
                },
                "type": 0
            },
            {
                "name": "娄底市",
                "id": "1018",
                "sub": {
                    "12": {
                        "name": "涟源市",
                        "id": "3300"
                    }
                },
                "type": 0
            },
            {
                "name": "湘西土家族苗族自治州",
                "id": "1018",
                "sub": {
                    "13": {
                        "name": "龙山县",
                        "id": "3308"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "广东省",
        "id": "1019",
        "sub": [
            {
                "name": "广州市",
                "id": "1019",
                "sub": [
                    {
                        "name": "从化市",
                        "id": "3321"
                    }
                ],
                "type": 0
            },
            {
                "name": "韶关市",
                "id": "1019",
                "sub": {
                    "1": {
                        "name": "南雄市",
                        "id": "3332"
                    }
                },
                "type": 0
            },
            {
                "name": "深圳市",
                "id": "1019",
                "sub": {
                    "2": {
                        "name": "盐田区",
                        "id": "3339"
                    }
                },
                "type": 0
            },
            {
                "name": "珠海市",
                "id": "1019",
                "sub": {
                    "3": {
                        "name": "金湾区",
                        "id": "3343"
                    }
                },
                "type": 0
            },
            {
                "name": "汕头市",
                "id": "1019",
                "sub": {
                    "4": {
                        "name": "南澳县",
                        "id": "3351"
                    }
                },
                "type": 0
            },
            {
                "name": "佛山市",
                "id": "1019",
                "sub": {
                    "5": {
                        "name": "高明区",
                        "id": "3357"
                    }
                },
                "type": 0
            },
            {
                "name": "江门市",
                "id": "1019",
                "sub": {
                    "6": {
                        "name": "恩平市",
                        "id": "3365"
                    }
                },
                "type": 0
            },
            {
                "name": "湛江市",
                "id": "1019",
                "sub": {
                    "7": {
                        "name": "吴川市",
                        "id": "3375"
                    }
                },
                "type": 0
            },
            {
                "name": "茂名市",
                "id": "1019",
                "sub": {
                    "8": {
                        "name": "信宜市",
                        "id": "3382"
                    }
                },
                "type": 0
            },
            {
                "name": "肇庆市",
                "id": "1019",
                "sub": {
                    "9": {
                        "name": "四会市",
                        "id": "3391"
                    }
                },
                "type": 0
            },
            {
                "name": "惠州市",
                "id": "1019",
                "sub": {
                    "10": {
                        "name": "龙门县",
                        "id": "3397"
                    }
                },
                "type": 0
            },
            {
                "name": "梅州市",
                "id": "1019",
                "sub": {
                    "11": {
                        "name": "兴宁市",
                        "id": "3406"
                    }
                },
                "type": 0
            },
            {
                "name": "汕尾市",
                "id": "1019",
                "sub": {
                    "12": {
                        "name": "陆丰市",
                        "id": "3411"
                    }
                },
                "type": 0
            },
            {
                "name": "河源市",
                "id": "1019",
                "sub": {
                    "13": {
                        "name": "东源县",
                        "id": "3418"
                    }
                },
                "type": 0
            },
            {
                "name": "阳江市",
                "id": "1019",
                "sub": {
                    "14": {
                        "name": "阳春市",
                        "id": "3423"
                    }
                },
                "type": 0
            },
            {
                "name": "清远市",
                "id": "1019",
                "sub": {
                    "15": {
                        "name": "连州市",
                        "id": "3432"
                    }
                },
                "type": 0
            },
            {
                "name": "东莞市",
                "id": "1019",
                "type": 0
            },
            {
                "name": "中山市",
                "id": "1019",
                "type": 0
            },
            {
                "name": "潮州市",
                "id": "1019",
                "sub": {
                    "18": {
                        "name": "饶平县",
                        "id": "3436"
                    }
                },
                "type": 0
            },
            {
                "name": "揭阳市",
                "id": "1019",
                "sub": {
                    "19": {
                        "name": "普宁市",
                        "id": "3442"
                    }
                },
                "type": 0
            },
            {
                "name": "云浮市",
                "id": "1019",
                "sub": {
                    "20": {
                        "name": "罗定市",
                        "id": "3448"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "广西壮族自治区",
        "id": "1020",
        "sub": [
            {
                "name": "南宁市",
                "id": "1020",
                "sub": [
                    {
                        "name": "横　县",
                        "id": "3461"
                    }
                ],
                "type": 0
            },
            {
                "name": "柳州市",
                "id": "1020",
                "sub": {
                    "1": {
                        "name": "三江侗族自治县",
                        "id": "3472"
                    }
                },
                "type": 0
            },
            {
                "name": "桂林市",
                "id": "1020",
                "sub": {
                    "2": {
                        "name": "恭城瑶族自治县",
                        "id": "3490"
                    }
                },
                "type": 0
            },
            {
                "name": "梧州市",
                "id": "1020",
                "sub": {
                    "3": {
                        "name": "岑溪市",
                        "id": "3498"
                    }
                },
                "type": 0
            },
            {
                "name": "北海市",
                "id": "1020",
                "sub": {
                    "4": {
                        "name": "合浦县",
                        "id": "3503"
                    }
                },
                "type": 0
            },
            {
                "name": "防城港市",
                "id": "1020",
                "sub": {
                    "5": {
                        "name": "东兴市",
                        "id": "3508"
                    }
                },
                "type": 0
            },
            {
                "name": "钦州市",
                "id": "1020",
                "sub": {
                    "6": {
                        "name": "浦北县",
                        "id": "3513"
                    }
                },
                "type": 0
            },
            {
                "name": "贵港市",
                "id": "1020",
                "sub": {
                    "7": {
                        "name": "桂平市",
                        "id": "3519"
                    }
                },
                "type": 0
            },
            {
                "name": "玉林市",
                "id": "1020",
                "sub": {
                    "8": {
                        "name": "北流市",
                        "id": "3526"
                    }
                },
                "type": 0
            },
            {
                "name": "百色市",
                "id": "1020",
                "sub": {
                    "9": {
                        "name": "隆林各族自治县",
                        "id": "3539"
                    }
                },
                "type": 0
            },
            {
                "name": "贺州市",
                "id": "1020",
                "sub": {
                    "10": {
                        "name": "富川瑶族自治县",
                        "id": "3544"
                    }
                },
                "type": 0
            },
            {
                "name": "河池市",
                "id": "1020",
                "sub": {
                    "11": {
                        "name": "宜州市",
                        "id": "3556"
                    }
                },
                "type": 0
            },
            {
                "name": "来宾市",
                "id": "1020",
                "sub": {
                    "12": {
                        "name": "合山市",
                        "id": "3563"
                    }
                },
                "type": 0
            },
            {
                "name": "崇左市",
                "id": "1020",
                "sub": {
                    "13": {
                        "name": "凭祥市",
                        "id": "3571"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "海南省",
        "id": "1021",
        "sub": [
            {
                "name": "海口市",
                "id": "1021",
                "sub": [
                    {
                        "name": "美兰区",
                        "id": "3576"
                    }
                ],
                "type": 0
            },
            {
                "name": "三亚市",
                "id": "1021",
                "sub": {
                    "1": {
                        "name": "全区",
                        "id": "3577"
                    }
                },
                "type": 0
            },
            {
                "name": "省直辖县级行政单位",
                "id": "1021",
                "sub": {
                    "2": {
                        "name": "中沙群岛的岛礁及其海域",
                        "id": "3596"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "重庆市",
        "id": "1022",
        "sub": [
            {
                "name": "全市",
                "id": "1022",
                "sub": [
                    {
                        "name": "长寿区",
                        "id": "3611"
                    }
                ],
                "type": 0
            },
            {
                "name": "县",
                "id": "1022",
                "sub": {
                    "1": {
                        "name": "彭水苗族土家族自治县",
                        "id": "3632"
                    }
                },
                "type": 0
            },
            {
                "name": "市",
                "id": "1022",
                "sub": {
                    "2": {
                        "name": "南川市",
                        "id": "3636"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "四川省",
        "id": "1023",
        "sub": [
            {
                "name": "成都市",
                "id": "1023",
                "sub": [
                    {
                        "name": "崇州市",
                        "id": "3656"
                    }
                ],
                "type": 0
            },
            {
                "name": "自贡市",
                "id": "1023",
                "sub": {
                    "1": {
                        "name": "富顺县",
                        "id": "3663"
                    }
                },
                "type": 0
            },
            {
                "name": "攀枝花市",
                "id": "1023",
                "sub": {
                    "2": {
                        "name": "盐边县",
                        "id": "3669"
                    }
                },
                "type": 0
            },
            {
                "name": "泸州市",
                "id": "1023",
                "sub": {
                    "3": {
                        "name": "古蔺县",
                        "id": "3677"
                    }
                },
                "type": 0
            },
            {
                "name": "德阳市",
                "id": "1023",
                "sub": {
                    "4": {
                        "name": "绵竹市",
                        "id": "3684"
                    }
                },
                "type": 0
            },
            {
                "name": "绵阳市",
                "id": "1023",
                "sub": {
                    "5": {
                        "name": "江油市",
                        "id": "3694"
                    }
                },
                "type": 0
            },
            {
                "name": "广元市",
                "id": "1023",
                "sub": {
                    "6": {
                        "name": "苍溪县",
                        "id": "3702"
                    }
                },
                "type": 0
            },
            {
                "name": "遂宁市",
                "id": "1023",
                "sub": {
                    "7": {
                        "name": "大英县",
                        "id": "3708"
                    }
                },
                "type": 0
            },
            {
                "name": "内江市",
                "id": "1023",
                "sub": {
                    "8": {
                        "name": "隆昌县",
                        "id": "3714"
                    }
                },
                "type": 0
            },
            {
                "name": "乐山市",
                "id": "1023",
                "sub": {
                    "9": {
                        "name": "峨眉山市",
                        "id": "3726"
                    }
                },
                "type": 0
            },
            {
                "name": "南充市",
                "id": "1023",
                "sub": {
                    "10": {
                        "name": "阆中市",
                        "id": "3736"
                    }
                },
                "type": 0
            },
            {
                "name": "眉山市",
                "id": "1023",
                "sub": {
                    "11": {
                        "name": "青神县",
                        "id": "3743"
                    }
                },
                "type": 0
            },
            {
                "name": "宜宾市",
                "id": "1023",
                "sub": {
                    "12": {
                        "name": "屏山县",
                        "id": "3754"
                    }
                },
                "type": 0
            },
            {
                "name": "广安市",
                "id": "1023",
                "sub": {
                    "13": {
                        "name": "华莹市",
                        "id": "3760"
                    }
                },
                "type": 0
            },
            {
                "name": "达州市",
                "id": "1023",
                "sub": {
                    "14": {
                        "name": "万源市",
                        "id": "3768"
                    }
                },
                "type": 0
            },
            {
                "name": "雅安市",
                "id": "1023",
                "sub": {
                    "15": {
                        "name": "宝兴县",
                        "id": "3777"
                    }
                },
                "type": 0
            },
            {
                "name": "巴中市",
                "id": "1023",
                "sub": {
                    "16": {
                        "name": "平昌县",
                        "id": "3782"
                    }
                },
                "type": 0
            },
            {
                "name": "资阳市",
                "id": "1023",
                "sub": {
                    "17": {
                        "name": "简阳市",
                        "id": "3787"
                    }
                },
                "type": 0
            },
            {
                "name": "阿坝藏族羌族自治州",
                "id": "1023",
                "sub": {
                    "18": {
                        "name": "红原县",
                        "id": "3800"
                    }
                },
                "type": 0
            },
            {
                "name": "甘孜藏族自治州",
                "id": "1023",
                "sub": {
                    "19": {
                        "name": "得荣县",
                        "id": "3818"
                    }
                },
                "type": 0
            },
            {
                "name": "凉山彝族自治州",
                "id": "1023",
                "sub": {
                    "20": {
                        "name": "雷波县",
                        "id": "3835"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "贵州省",
        "id": "1024",
        "sub": [
            {
                "name": "贵阳市",
                "id": "1024",
                "sub": [
                    {
                        "name": "清镇市",
                        "id": "3846"
                    }
                ],
                "type": 0
            },
            {
                "name": "六盘水市",
                "id": "1024",
                "sub": {
                    "1": {
                        "name": "盘　县",
                        "id": "3850"
                    }
                },
                "type": 0
            },
            {
                "name": "遵义市",
                "id": "1024",
                "sub": {
                    "2": {
                        "name": "仁怀市",
                        "id": "3865"
                    }
                },
                "type": 0
            },
            {
                "name": "安顺市",
                "id": "1024",
                "sub": {
                    "3": {
                        "name": "紫云苗族布依族自治县",
                        "id": "3872"
                    }
                },
                "type": 0
            },
            {
                "name": "铜仁地区",
                "id": "1024",
                "sub": {
                    "4": {
                        "name": "万山特区",
                        "id": "3882"
                    }
                },
                "type": 0
            },
            {
                "name": "黔西南布依族苗族自治州",
                "id": "1024",
                "sub": {
                    "5": {
                        "name": "安龙县",
                        "id": "3890"
                    }
                },
                "type": 0
            },
            {
                "name": "毕节地区",
                "id": "1024",
                "sub": {
                    "6": {
                        "name": "赫章县",
                        "id": "3898"
                    }
                },
                "type": 0
            },
            {
                "name": "黔东南苗族侗族自治州",
                "id": "1024",
                "sub": {
                    "7": {
                        "name": "丹寨县",
                        "id": "3914"
                    }
                },
                "type": 0
            },
            {
                "name": "黔南布依族苗族自治州",
                "id": "1024",
                "sub": {
                    "8": {
                        "name": "三都水族自治县",
                        "id": "3926"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "云南省",
        "id": "1025",
        "sub": [
            {
                "name": "昆明市",
                "id": "1025",
                "sub": [
                    {
                        "name": "安宁市",
                        "id": "3941"
                    }
                ],
                "type": 0
            },
            {
                "name": "曲靖市",
                "id": "1025",
                "sub": {
                    "1": {
                        "name": "宣威市",
                        "id": "3951"
                    }
                },
                "type": 0
            },
            {
                "name": "玉溪市",
                "id": "1025",
                "sub": {
                    "2": {
                        "name": "元江哈尼族彝族傣族自治县",
                        "id": "3961"
                    }
                },
                "type": 0
            },
            {
                "name": "保山市",
                "id": "1025",
                "sub": {
                    "3": {
                        "name": "昌宁县",
                        "id": "3967"
                    }
                },
                "type": 0
            },
            {
                "name": "昭通市",
                "id": "1025",
                "sub": {
                    "4": {
                        "name": "水富县",
                        "id": "3979"
                    }
                },
                "type": 0
            },
            {
                "name": "丽江市",
                "id": "1025",
                "sub": {
                    "5": {
                        "name": "宁蒗彝族自治县",
                        "id": "3985"
                    }
                },
                "type": 0
            },
            {
                "name": "思茅市",
                "id": "1025",
                "sub": {
                    "6": {
                        "name": "西盟佤族自治县",
                        "id": "3996"
                    }
                },
                "type": 0
            },
            {
                "name": "临沧市",
                "id": "1025",
                "sub": {
                    "7": {
                        "name": "沧源佤族自治县",
                        "id": "4005"
                    }
                },
                "type": 0
            },
            {
                "name": "楚雄彝族自治州",
                "id": "1025",
                "sub": {
                    "8": {
                        "name": "禄丰县",
                        "id": "4015"
                    }
                },
                "type": 0
            },
            {
                "name": "红河哈尼族彝族自治州",
                "id": "1025",
                "sub": {
                    "9": {
                        "name": "河口瑶族自治县",
                        "id": "4028"
                    }
                },
                "type": 0
            },
            {
                "name": "文山壮族苗族自治州",
                "id": "1025",
                "sub": {
                    "10": {
                        "name": "富宁县",
                        "id": "4036"
                    }
                },
                "type": 0
            },
            {
                "name": "西双版纳傣族自治州",
                "id": "1025",
                "sub": {
                    "11": {
                        "name": "勐腊县",
                        "id": "4039"
                    }
                },
                "type": 0
            },
            {
                "name": "大理白族自治州",
                "id": "1025",
                "sub": {
                    "12": {
                        "name": "鹤庆县",
                        "id": "4051"
                    }
                },
                "type": 0
            },
            {
                "name": "德宏傣族景颇族自治州",
                "id": "1025",
                "sub": {
                    "13": {
                        "name": "陇川县",
                        "id": "4056"
                    }
                },
                "type": 0
            },
            {
                "name": "怒江傈僳族自治州",
                "id": "1025",
                "sub": {
                    "14": {
                        "name": "兰坪白族普米族自治县",
                        "id": "4060"
                    }
                },
                "type": 0
            },
            {
                "name": "迪庆藏族自治州",
                "id": "1025",
                "sub": {
                    "15": {
                        "name": "维西傈僳族自治县",
                        "id": "4063"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "西藏自治区",
        "id": "1026",
        "sub": [
            {
                "name": "拉萨市",
                "id": "1026",
                "sub": [
                    {
                        "name": "墨竹工卡县",
                        "id": "4072"
                    }
                ],
                "type": 0
            },
            {
                "name": "昌都地区",
                "id": "1026",
                "sub": {
                    "1": {
                        "name": "边坝县",
                        "id": "4083"
                    }
                },
                "type": 0
            },
            {
                "name": "山南地区",
                "id": "1026",
                "sub": {
                    "2": {
                        "name": "浪卡子县",
                        "id": "4095"
                    }
                },
                "type": 0
            },
            {
                "name": "日喀则地区",
                "id": "1026",
                "sub": {
                    "3": {
                        "name": "岗巴县",
                        "id": "4113"
                    }
                },
                "type": 0
            },
            {
                "name": "那曲地区",
                "id": "1026",
                "sub": {
                    "4": {
                        "name": "尼玛县",
                        "id": "4123"
                    }
                },
                "type": 0
            },
            {
                "name": "阿里地区",
                "id": "1026",
                "sub": {
                    "5": {
                        "name": "措勤县",
                        "id": "4130"
                    }
                },
                "type": 0
            },
            {
                "name": "林芝地区",
                "id": "1026",
                "sub": {
                    "6": {
                        "name": "朗　县",
                        "id": "4137"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "陕西省",
        "id": "1027",
        "sub": [
            {
                "name": "西安市",
                "id": "1027",
                "sub": [
                    {
                        "name": "高陵县",
                        "id": "4151"
                    }
                ],
                "type": 0
            },
            {
                "name": "铜川市",
                "id": "1027",
                "sub": {
                    "1": {
                        "name": "宜君县",
                        "id": "4156"
                    }
                },
                "type": 0
            },
            {
                "name": "宝鸡市",
                "id": "1027",
                "sub": {
                    "2": {
                        "name": "太白县",
                        "id": "4169"
                    }
                },
                "type": 0
            },
            {
                "name": "咸阳市",
                "id": "1027",
                "sub": {
                    "3": {
                        "name": "兴平市",
                        "id": "4184"
                    }
                },
                "type": 0
            },
            {
                "name": "渭南市",
                "id": "1027",
                "sub": {
                    "4": {
                        "name": "华阴市",
                        "id": "4196"
                    }
                },
                "type": 0
            },
            {
                "name": "延安市",
                "id": "1027",
                "sub": {
                    "5": {
                        "name": "黄陵县",
                        "id": "4210"
                    }
                },
                "type": 0
            },
            {
                "name": "汉中市",
                "id": "1027",
                "sub": {
                    "6": {
                        "name": "佛坪县",
                        "id": "4222"
                    }
                },
                "type": 0
            },
            {
                "name": "榆林市",
                "id": "1027",
                "sub": {
                    "7": {
                        "name": "子洲县",
                        "id": "4235"
                    }
                },
                "type": 0
            },
            {
                "name": "安康市",
                "id": "1027",
                "sub": {
                    "8": {
                        "name": "白河县",
                        "id": "4246"
                    }
                },
                "type": 0
            },
            {
                "name": "商洛市",
                "id": "1027",
                "sub": {
                    "9": {
                        "name": "柞水县",
                        "id": "4254"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "甘肃省",
        "id": "1028",
        "sub": [
            {
                "name": "兰州市",
                "id": "1028",
                "sub": [
                    {
                        "name": "榆中县",
                        "id": "4263"
                    }
                ],
                "type": 0
            },
            {
                "name": "嘉峪关市",
                "id": "1028",
                "sub": {
                    "1": {
                        "name": "全区",
                        "id": "4264"
                    }
                },
                "type": 0
            },
            {
                "name": "金昌市",
                "id": "1028",
                "sub": {
                    "2": {
                        "name": "永昌县",
                        "id": "4267"
                    }
                },
                "type": 0
            },
            {
                "name": "白银市",
                "id": "1028",
                "sub": {
                    "3": {
                        "name": "景泰县",
                        "id": "4273"
                    }
                },
                "type": 0
            },
            {
                "name": "天水市",
                "id": "1028",
                "sub": {
                    "4": {
                        "name": "张家川回族自治县",
                        "id": "4281"
                    }
                },
                "type": 0
            },
            {
                "name": "武威市",
                "id": "1028",
                "sub": {
                    "5": {
                        "name": "天祝藏族自治县",
                        "id": "4286"
                    }
                },
                "type": 0
            },
            {
                "name": "张掖市",
                "id": "1028",
                "sub": {
                    "6": {
                        "name": "山丹县",
                        "id": "4293"
                    }
                },
                "type": 0
            },
            {
                "name": "平凉市",
                "id": "1028",
                "sub": {
                    "7": {
                        "name": "静宁县",
                        "id": "4301"
                    }
                },
                "type": 0
            },
            {
                "name": "酒泉市",
                "id": "1028",
                "sub": {
                    "8": {
                        "name": "敦煌市",
                        "id": "4309"
                    }
                },
                "type": 0
            },
            {
                "name": "庆阳市",
                "id": "1028",
                "sub": {
                    "9": {
                        "name": "镇原县",
                        "id": "4318"
                    }
                },
                "type": 0
            },
            {
                "name": "定西市",
                "id": "1028",
                "sub": {
                    "10": {
                        "name": "岷　县",
                        "id": "4326"
                    }
                },
                "type": 0
            },
            {
                "name": "陇南市",
                "id": "1028",
                "sub": {
                    "11": {
                        "name": "两当县",
                        "id": "4336"
                    }
                },
                "type": 0
            },
            {
                "name": "临夏回族自治州",
                "id": "1028",
                "sub": {
                    "12": {
                        "name": "积石山保安族东乡族撒拉族自治县",
                        "id": "4344"
                    }
                },
                "type": 0
            },
            {
                "name": "甘南藏族自治州",
                "id": "1028",
                "sub": {
                    "13": {
                        "name": "夏河县",
                        "id": "4352"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "青海省",
        "id": "1029",
        "sub": [
            {
                "name": "西宁市",
                "id": "1029",
                "sub": [
                    {
                        "name": "湟源县",
                        "id": "4360"
                    }
                ],
                "type": 0
            },
            {
                "name": "海东地区",
                "id": "1029",
                "sub": {
                    "1": {
                        "name": "循化撒拉族自治县",
                        "id": "4366"
                    }
                },
                "type": 0
            },
            {
                "name": "海北藏族自治州",
                "id": "1029",
                "sub": {
                    "2": {
                        "name": "刚察县",
                        "id": "4370"
                    }
                },
                "type": 0
            },
            {
                "name": "黄南藏族自治州",
                "id": "1029",
                "sub": {
                    "3": {
                        "name": "河南蒙古族自治县",
                        "id": "4374"
                    }
                },
                "type": 0
            },
            {
                "name": "海南藏族自治州",
                "id": "1029",
                "sub": {
                    "4": {
                        "name": "贵南县",
                        "id": "4379"
                    }
                },
                "type": 0
            },
            {
                "name": "果洛藏族自治州",
                "id": "1029",
                "sub": {
                    "5": {
                        "name": "玛多县",
                        "id": "4385"
                    }
                },
                "type": 0
            },
            {
                "name": "玉树藏族自治州",
                "id": "1029",
                "sub": {
                    "6": {
                        "name": "曲麻莱县",
                        "id": "4391"
                    }
                },
                "type": 0
            },
            {
                "name": "海西蒙古族藏族自治州",
                "id": "1029",
                "sub": {
                    "7": {
                        "name": "天峻县",
                        "id": "4396"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "宁夏回族自治区",
        "id": "1030",
        "sub": [
            {
                "name": "银川市",
                "id": "1030",
                "sub": [
                    {
                        "name": "灵武市",
                        "id": "4403"
                    }
                ],
                "type": 0
            },
            {
                "name": "石嘴山市",
                "id": "1030",
                "sub": {
                    "1": {
                        "name": "平罗县",
                        "id": "4407"
                    }
                },
                "type": 0
            },
            {
                "name": "吴忠市",
                "id": "1030",
                "sub": {
                    "2": {
                        "name": "青铜峡市",
                        "id": "4412"
                    }
                },
                "type": 0
            },
            {
                "name": "固原市",
                "id": "1030",
                "sub": {
                    "3": {
                        "name": "海原县",
                        "id": "4422"
                    }
                },
                "type": 0
            },
            {
                "name": "中卫市",
                "id": "1030",
                "sub": {
                    "4": {
                        "name": "中宁县",
                        "id": "4421"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "新疆维吾尔自治区",
        "id": "1031",
        "sub": [
            {
                "name": "乌鲁木齐市",
                "id": "1031",
                "sub": [
                    {
                        "name": "乌鲁木齐县",
                        "id": "4431"
                    }
                ],
                "type": 0
            },
            {
                "name": "克拉玛依市",
                "id": "1031",
                "sub": {
                    "1": {
                        "name": "乌尔禾区",
                        "id": "4436"
                    }
                },
                "type": 0
            },
            {
                "name": "吐鲁番地区",
                "id": "1031",
                "sub": {
                    "2": {
                        "name": "托克逊县",
                        "id": "4439"
                    }
                },
                "type": 0
            },
            {
                "name": "哈密地区",
                "id": "1031",
                "sub": {
                    "3": {
                        "name": "伊吾县",
                        "id": "4442"
                    }
                },
                "type": 0
            },
            {
                "name": "昌吉回族自治州",
                "id": "1031",
                "sub": {
                    "4": {
                        "name": "木垒哈萨克自治县",
                        "id": "4450"
                    }
                },
                "type": 0
            },
            {
                "name": "博尔塔拉蒙古自治州",
                "id": "1031",
                "sub": {
                    "5": {
                        "name": "温泉县",
                        "id": "4453"
                    }
                },
                "type": 0
            },
            {
                "name": "巴音郭楞蒙古自治州",
                "id": "1031",
                "sub": {
                    "6": {
                        "name": "博湖县",
                        "id": "4462"
                    }
                },
                "type": 0
            },
            {
                "name": "阿克苏地区",
                "id": "1031",
                "sub": {
                    "7": {
                        "name": "柯坪县",
                        "id": "4471"
                    }
                },
                "type": 0
            },
            {
                "name": "克孜勒苏柯尔克孜自治州",
                "id": "1031",
                "sub": {
                    "8": {
                        "name": "乌恰县",
                        "id": "4475"
                    }
                },
                "type": 0
            },
            {
                "name": "喀什地区",
                "id": "1031",
                "sub": {
                    "9": {
                        "name": "塔什库尔干塔吉克自治县",
                        "id": "4487"
                    }
                },
                "type": 0
            },
            {
                "name": "和田地区",
                "id": "1031",
                "sub": {
                    "10": {
                        "name": "民丰县",
                        "id": "4495"
                    }
                },
                "type": 0
            },
            {
                "name": "伊犁哈萨克自治州",
                "id": "1031",
                "sub": {
                    "11": {
                        "name": "尼勒克县",
                        "id": "4505"
                    }
                },
                "type": 0
            },
            {
                "name": "塔城地区",
                "id": "1031",
                "sub": {
                    "12": {
                        "name": "和布克赛尔蒙古自治县",
                        "id": "4512"
                    }
                },
                "type": 0
            },
            {
                "name": "阿勒泰地区",
                "id": "1031",
                "sub": {
                    "13": {
                        "name": "吉木乃县",
                        "id": "4519"
                    }
                },
                "type": 0
            },
            {
                "name": "省直辖行政单位",
                "id": "1031",
                "sub": {
                    "14": {
                        "name": "五家渠市",
                        "id": "4523"
                    }
                },
                "type": 0
            }
        ],
        "type": 1
    },
    {
        "name": "台湾省",
        "id": "1032",
        "type": 1
    },
    {
        "name": "香港特别行政区",
        "id": "1033",
        "type": 1
    },
    {
        "name": "澳门特别行政区",
        "id": "1034",
        "type": 1
    }
];

}(Zepto);
// jshint ignore: end

/* jshint unused:false*/

+ function($) {
    "use strict";
    var format = function(data) {
        var result = [];
        for(var i=0;i<data.length;i++) {
            var d = data[i];
            if(d.name === "请选择") continue;
            result.push({values:d.id,displayValues:d.name});
        }
        if(result.length) return result;
        return [""];
    };

    var sub = function(data) {
        if(!data.sub) return [""];
        return format(data.sub);
    };

    var getCities = function(d) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].id === d) return sub(raw[i]);
        }
        return [""];
    };

    var getDistricts = function(p, c) {
        for(var i=0;i< raw.length;i++) {
            if(raw[i].id === p) {
                for(var j=0;j< raw[i].sub.length;j++) {
                    if(raw[i].sub[j].id === c) {
                        return sub(raw[i].sub[j]);
                    }
                }
            }
        }
        return [""];
    };

    var raw = $.smConfig.rawCitiesData;
    var provinces = raw.map(function(d) {
        return d.name;
    });
    var provincesIds = raw.map(function(d) {
        return d.id;
    });
    var initCities = sub(raw[0].id);
    var initCitiesDisplay = sub(raw[0].name);
    var initDistricts = [""];

    var currentProvince = provinces[0];
    var currentCity = initCities[0];
    var currentDistrict = initDistricts[0];

    var t;
    var defaults = {

        cssClass: "city-picker",
        rotateEffect: false,  //为了性能

        onChange: function (picker, values, displayValues) {
            var newProvince = picker.cols[0].value;
            var newCity=[];
            var newCityDisplay=[];
            if(newProvince !== currentProvince) {
                // 如果Province变化，节流以提高reRender性能
                clearTimeout(t);

                t = setTimeout(function(){
                    var newCities = getCities(newProvince);
                    newCity[0] = newCities[0].values;
                    newCityDisplay[0] = newCities[0].displayValues;
                    var newDistricts = getDistricts(newProvince, newCity[0]);
                    console.log(newDistricts);
                    picker.cols[1].replaceValues(newCity,newCityDisplay);
                    picker.cols[2].replaceValues(newDistricts);
                    currentProvince = newProvince;
                    currentCity = newCity;
                    picker.updateValue();
                }, 200);
                return;
            }
            newCity = picker.cols[1].value;
            if(newCity !== currentCity) {
                picker.cols[2].replaceValues(getDistricts(newProvince, newCity));
                currentCity = newCity;
                picker.updateValue();
            }
        },

        cols: [
        {
            textAlign: 'center',
            values: provincesIds,
            displayValues:provinces,
            cssClass: "col-province"
        },
        {
            textAlign: 'center',
            values: initCities,
            displayValues:initCitiesDisplay,
            cssClass: "col-city"
        },
        {
            textAlign: 'center',
            values: initDistricts,
            //displayValues:initDistricts,
            cssClass: "col-district"
        }
        ]
    };

    $.fn.cityPicker = function(params) {
        return this.each(function() {
            if(!this) return;
            var p = $.extend(defaults, params);
            //计算value
            if (p.value) {
                $(this).val(p.value.join(' '));
            } else {
                var val = $(this).val();
                val && (p.value = val.split(' '));
            }

            if (p.value) {
                //p.value = val.split(" ");
                if(p.value[0]) {
                    currentProvince = p.value[0];
                    p.cols[1].values = getCities(p.value[0]);
                }
                if(p.value[1]) {
                    currentCity = p.value[1];
                    p.cols[2].values = getDistricts(p.value[0], p.value[1]);
                } else {
                    p.cols[2].values = getDistricts(p.value[0], p.cols[1].values[0]);
                }
                !p.value[2] && (p.value[2] = '');
                currentDistrict = p.value[2];
            }
            $(this).picker(p);
        });
    };

}(Zepto);
